content/posts/wu2010.md
+++
title = "wu2010 | Modelling rigid origami with quaternions and dual quaternions"
author = ["João Gutemberg Farias"]
draft = false
+++

The work uses the correspondence between single-vertex rigid origami and spherical linkage to model it as quaternions and the correspondence of multi-vertex rigid origami and spatial linkage to model it as dual quaternions.


## Info {#info}

This paper examines the mathematical modelling of rigid origami, a type of origami where all the panels are rigid and can only rotate about crease lines. The rotating vector model is proposed, which establishes the loop-closure conditions among a group of characteristic vectors. By building up an explicit relationship between the single-vertex origami and the spherical linkage mechanism, the rotating vector model can conveniently and directly describe arbitrary three-dimensional configurations and can detect some self-intersection. Quaternion and dual quaternion are then employed to represent the origami model, based on which two numerical methods have been developed. Through examples, it has been shown that the first method can effectively track the entire rigid-folding procedure of an initially flat or a non-flat pattern with a single vertex or multiple vertices, and thereby provide judgment for its rigid foldability and flat foldability. Furthermore, its ability to rule out some self-intersecting configurations during folding is illustrated in detail, leading to its ability of checking rigid foldability in a more or less sufficient way. The second method is especially for analysing the multi-vertex origami. It can also effectively track the trajectories of multiple vertices during folding.


## Notes {#notes}


### Resumo {#resumo}

The work uses the correspondence between single-vertex rigid origami to model it as quaternions and the correspondence of multi-vertex rigid origami and spatial linkage to model it as dual quaternions.
